[
  {
    "image": "https://i.ibb.co.com/CpJBJLH7/photomaster.png",
    "title": "PhotoMaster Pro",
    "companyName": "PixelCraft Ltd",
    "id": 1,
    "description": "PhotoMaster Pro is your AI-powered editing companion. It enhances colors, removes blemishes, and adds cinematic effects.\nThe interface is sleek and beginner-friendly, making photo editing easy for everyone. Turn ordinary photos into professional art in seconds.\nAdvanced AI features automatically detect subjects and optimize images. Apply creative filters, adjust lighting, and correct perspectives quickly.\nWith batch processing, you can edit multiple photos simultaneously. Share your masterpieces instantly to social media. PhotoMaster Pro transforms photography effortlessly.",
    "size": 95,
    "reviews": 2430,
    "ratingAvg": 4.6,
    "downloads": "1.2M",
    "ratings": [
      { "name": "1 star", "count": 120 },
      { "name": "2 star", "count": 210 },
      { "name": "3 star", "count": 340 },
      { "name": "4 star", "count": 860 },
      { "name": "5 star", "count": 900 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/DDhbrSLg/Task-Flow-Manager.png",
    "title": "TaskFlow Manager",
    "companyName": "NextGen Apps",
    "id": 2,
    "description": "TaskFlow Manager simplifies your daily planning. Create, track, and complete tasks with smart reminders.\nVisualize productivity trends using charts, helping you stay organized and stress-free. Prioritize important tasks effortlessly.\nCollaborate with team members, share updates, and sync across devices. Automate recurring tasks and deadlines easily.\nBoost your efficiency with detailed reports and goal tracking. Stay focused on what matters most. TaskFlow Manager ensures you achieve more every day.",
    "size": 60,
    "reviews": 980,
    "ratingAvg": 4.2,
    "downloads": "540K",
    "ratings": [
      { "name": "1 star", "count": 70 },
      { "name": "2 star", "count": 100 },
      { "name": "3 star", "count": 190 },
      { "name": "4 star", "count": 320 },
      { "name": "5 star", "count": 300 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/bMcS6PWD/Galaxy-Defender.webp",
    "title": "Galaxy Defender",
    "companyName": "Nova Games Studio",
    "id": 3,
    "description": "Defend the galaxy from alien invasions in this thrilling action game. Fly across stars, upgrade your ships, and battle epic bosses.\nStunning graphics make every level exciting. Challenge your reflexes and conquer the cosmos with skillful maneuvers.\nCustomize your fleet and unlock powerful weapons. Explore new galaxies and complete unique missions. Experience immersive soundtracks and epic space battles.\nCompete with friends and share achievements. Keep upgrading your ships for tougher challenges. Galaxy Defender offers endless interstellar excitement.",
    "size": 210,
    "reviews": 5120,
    "ratingAvg": 4.8,
    "downloads": "2.3M",
    "ratings": [
      { "name": "1 star", "count": 90 },
      { "name": "2 star", "count": 150 },
      { "name": "3 star", "count": 330 },
      { "name": "4 star", "count": 860 },
      { "name": "5 star", "count": 3690 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/cXNBfRyK/Fit-Zone-Tracke.webp",
    "title": "FitZone Tracker",
    "companyName": "HealthSync Co.",
    "id": 4,
    "description": "Stay fit with real-time workout tracking and health tips. Monitor calories, steps, and heart rate easily.\nSet personalized fitness goals and track progress efficiently. Get reminders to stay active and consistent every day.\nAnalyze trends in your workouts and adjust routines as needed. Receive motivational insights and healthy lifestyle tips.\nConnect with friends, join challenges, and celebrate achievements. FitZone helps you stay committed. Build a stronger and healthier you effortlessly.",
    "size": 80,
    "reviews": 1800,
    "ratingAvg": 4.3,
    "downloads": "870K",
    "ratings": [
      { "name": "1 star", "count": 90 },
      { "name": "2 star", "count": 150 },
      { "name": "3 star", "count": 310 },
      { "name": "4 star", "count": 580 },
      { "name": "5 star", "count": 670 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/b5kzVSzB/Mind-Ease-Meditation.webp",
    "title": "MindEase Meditation",
    "companyName": "CalmSpace Studios",
    "id": 5,
    "description": "MindEase helps you relax through guided meditation. Reduce stress and improve focus with daily sessions.\nEnjoy soothing soundscapes and mindfulness stories. Perfect for sleep, peace, and inner balance.\nTrack your meditation streaks and observe mood improvements over time. Customize sessions based on time and intensity.\nAccess breathing exercises, calming visuals, and mental wellness tips. MindEase creates a peaceful daily ritual. Experience complete mental relaxation anytime.",
    "size": 45,
    "reviews": 3200,
    "ratingAvg": 4.7,
    "downloads": "1.4M",
    "ratings": [
      { "name": "1 star", "count": 130 },
      { "name": "2 star", "count": 160 },
      { "name": "3 star", "count": 250 },
      { "name": "4 star", "count": 690 },
      { "name": "5 star", "count": 1970 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/dwwqJK5D/Langify-Learn.webp",
    "title": "Langify Learn",
    "companyName": "EduVerse Labs",
    "id": 6,
    "description": "Master new languages faster with AI tutoring. Learn through interactive exercises and real dialogues.\nTrack progress with detailed analytics. Set daily goals and practice speaking, listening, and writing effectively.\nJoin community challenges and practice with native speakers. Enjoy fun quizzes, flashcards, and vocabulary games.\nLangify Learn adapts to your level and learning pace. Stay motivated with achievement badges. Make language learning simple and effective.",
    "size": 110,
    "reviews": 2750,
    "ratingAvg": 4.5,
    "downloads": "950K",
    "ratings": [
      { "name": "1 star", "count": 160 },
      { "name": "2 star", "count": 210 },
      { "name": "3 star", "count": 300 },
      { "name": "4 star", "count": 700 },
      { "name": "5 star", "count": 1380 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/qFj1tsLf/Budget-Buddy.webp",
    "title": "BudgetBuddy",
    "companyName": "FinWise Technologies",
    "id": 7,
    "description": "BudgetBuddy tracks your expenses and income with ease. Set monthly limits and get insights instantly.\nVisual charts show where your money goes. Receive reminders for bills, subscriptions, and savings targets.\nAnalyze spending habits and make smarter financial decisions. Connect bank accounts securely for seamless tracking.\nGenerate reports to plan future budgets. Save more while avoiding unnecessary expenses. BudgetBuddy simplifies personal finance management.",
    "size": 55,
    "reviews": 1450,
    "ratingAvg": 4.1,
    "downloads": "670K",
    "ratings": [
      { "name": "1 star", "count": 140 },
      { "name": "2 star", "count": 210 },
      { "name": "3 star", "count": 360 },
      { "name": "4 star", "count": 420 },
      { "name": "5 star", "count": 320 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/5W160bW4/NoteNest.png",
    "title": "NoteNest",
    "companyName": "BrightApps Studio",
    "id": 8,
    "description": "NoteNest keeps your thoughts organized and synced. Capture notes, tasks, and reminders effortlessly.\nUse voice input or quick templates anytime. Organize ideas with categories and tags for easy retrieval.\nCollaborate with others and share notes across devices. Set reminders to never miss deadlines.\nCustomize layouts, colors, and themes to fit your style. NoteNest ensures productivity and creativity go hand in hand. Keep all your ideas safe and accessible.",
    "size": 38,
    "reviews": 860,
    "ratingAvg": 4.4,
    "downloads": "410K",
    "ratings": [
      { "name": "1 star", "count": 60 },
      { "name": "2 star", "count": 80 },
      { "name": "3 star", "count": 150 },
      { "name": "4 star", "count": 290 },
      { "name": "5 star", "count": 280 }
    ]
  }

]